weekly/weekly.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>ACM Computing Seminar Schedule</title>
<!-- 2016-06-10 Fri 10:14 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">ACM Computing Seminar Schedule</h1>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="weekly">


<colgroup>
<col  class="center" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="center">Week</th>
<th scope="col" class="left">C++</th>
<th scope="col" class="left">Fortran</th>
<th scope="col" class="left">Common</th>
<th scope="col" class="left">Examples</th>
<th scope="col" class="left">Assignment</th>
</tr>
</thead>
<tbody>
<tr>
<td class="center">1</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">- Compilers</td>
<td class="left">- Hello, world.</td>
<td class="left">Write some simple program.</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">- Editors</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">- OS-specific stuff</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">- Basic printing</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="center">2</td>
<td class="left">- Const type</td>
<td class="left">&#xa0;</td>
<td class="left">- Built-in data types</td>
<td class="left">- Binomial coef.</td>
<td class="left">Sum a convergent series,</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">- Typedef</td>
<td class="left">&#xa0;</td>
<td class="left">- Control structures</td>
<td class="left">- Fibonacci sequence</td>
<td class="left">return and print final value</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">- Euler's method</td>
<td class="left">when a specified tolerance</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">is met.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="center">3</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">- Functions</td>
<td class="left">- Function stuff?</td>
<td class="left">Function values sampled uniformly</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">- File I/O</td>
<td class="left">- Read a file</td>
<td class="left">are stored in a file. Write a</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">- Write to a file</td>
<td class="left">function to read the file and</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">compute the sampled function's</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">integral.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="center">4</td>
<td class="left">- Pointers</td>
<td class="left">&#xa0;</td>
<td class="left">- Arrays</td>
<td class="left">- Inner product</td>
<td class="left">Convolve a noisy vector with a</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">- Linear combination</td>
<td class="left">gaussian filter with various</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">- Convolution</td>
<td class="left">bandwidth values.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="center">5</td>
<td class="left">- Constructors</td>
<td class="left">- Fortran OO</td>
<td class="left">- Object-oriented programming</td>
<td class="left">- Dense matrix class</td>
<td class="left">Extend examples classes in some</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">- Destructors</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">way. Maybe add a member function</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">- Private / public methods</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">or two.</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">- Friend functions</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">- Operator overloading</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="center">6</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">- Non C++ / Fortran?</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">- Plotting?</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">- Can we do this?</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</body>
</html>
